Revit 2027 API
IFCUserDefinedPropertySet.IsValidName Method
 Checks whether the proposed name is valid and not exist in the specified document.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool IsValidName(
	Document document,
	string name
)
Public Shared Function IsValidName (
	document As Document,
	name As String
) As Boolean
public:
static bool IsValidName(
	Document^ document,
	String^ name
)
static member IsValidName :
        document : Document *
        name : string -> bool
Parameters
document Document
 The document to check
name String
 The name to check.
Return Value
Boolean
 Whether or not the name is valid.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 Name can't be blank. If true, the name is valid and not exist in specified document. If false, the name is not a valid name which means it does not exist in specified document.
See Also
Reference
IFCUserDefinedPropertySet Class
Autodesk.Revit.DB Namespace